In [1]:
# Let's try to bring in the csv file here

import pandas as pd

df = pd.read_csv("City Rating.csv")
df

,Unnamed: 0,cities,temp10,temp11,empty_temp,idreesRating,ibrahimRating,melRating
0,0,KL,23,32,NaN,5,5,-1
1,1,HK,29,31,NaN,3,4,5
2,2,SG,40,50,NaN,3,1,4
3,3,NY,0,34,NaN,3,5,2
4,4,HLS,5,-2,NaN,3,2,3

In [6]:
df2 = pd.read_csv("City Rating without Row Numbers.csv")
df2

  cities  temp10  temp11  empty_temp  idreesRating  ibrahimRating  melRating
0     KL      23      32         NaN             5              5         -1
1     HK      29      31         NaN             3              4          5
2     SG      40      50         NaN             3              1          4
3     NY       0      34         NaN             3              5          2
4    HLS       5      -2         NaN             3              2          3

In [7]:
df3 = pd.read_csv("grades.csv")
df3

      name  Idrees  Mel  Ibrahim
0    maths      96   95       94
1  english      96   95       94
2  science      96   95       94

In [3]:
df

,Unnamed: 0,cities,temp10,temp11,empty_temp,idreesRating,ibrahimRating,melRating
0,0,KL,23,32,NaN,5,5,-1
1,1,HK,29,31,NaN,3,4,5
2,2,SG,40,50,NaN,3,1,4
3,3,NY,0,34,NaN,3,5,2
4,4,HLS,5,-2,NaN,3,2,3

In [ ]:
df.drop('Unnamed: 0', axis=1) # columns, axis = 1

  cities  temp10  temp11  empty_temp  idreesRating  ibrahimRating  melRating
0     KL      23      32         NaN             5              5         -1
1     HK      29      31         NaN             3              4          5
2     SG      40      50         NaN             3              1          4
3     NY       0      34         NaN             3              5          2
4    HLS       5      -2         NaN             3              2          3

In [6]:
df.drop(4, axis = 0) # axis 0 ---> rows

,Unnamed: 0,cities,temp10,temp11,empty_temp,idreesRating,ibrahimRating,melRating
0,0,KL,23,32,NaN,5,5,-1
1,1,HK,29,31,NaN,3,4,5
2,2,SG,40,50,NaN,3,1,4
3,3,NY,0,34,NaN,3,5,2